recruitbody.xml

<?xml version="1.0" encoding="utf-8"?>
<env:Envelope
    xmlns:env="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:xsd="http://www.w3.org/2001/XMLSchema"
    xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
    <env:Header>
        <wsse:Security env:mustUnderstand="1">
            <wsse:UsernameToken>
                <wsse:Username>AssistlyISU@assistnow</wsse:Username>
                <wsse:Password>@Assistly@123!!</wsse:Password>
            </wsse:UsernameToken>
        </wsse:Security>
    </env:Header>
    <env:Body>
        <wd:Get_Job_Requisitions_Request
            xmlns:wd="urn:com.workday/bsvc"
            wd:version="v44.0">
           <wd:Response_Filter>
                <wd:As_Of_Effective_Date>2025-12-03</wd:As_Of_Effective_Date>
                <wd:As_Of_Entry_DateTime>2025-12-03T13:25:58</wd:As_Of_Entry_DateTime>
        </wd:Response_Filter>
        </wd:Get_Job_Requisitions_Request>
    </env:Body>
</env:Envelope>